archive/before-2018-11-10/2017-12-06-聊聊C语言的动态链接库.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-01 Mon 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>C语言的动态链接库</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Peng Xie" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">C语言的动态链接库</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4979e26">1. 动态链接库例子</a></li>
<li><a href="#org650ab7c">2. 一个更详细的例子和说明（翻译）</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4979e26" class="outline-2">
<h2 id="org4979e26"><span class="section-number-2">1</span> 动态链接库例子</h2>
<div class="outline-text-2" id="text-1">
<p>
写一个 <code>lib.c</code> 函数：
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #d18aff;">    #include</span> <span style="color: #ff4ea3;">&lt;stdio.h&gt;</span>

    <span style="color: #00d7af;">int</span> <span style="color: #ffd700;">from_lib</span>()
    {
        printf(<span style="color: #ff4ea3;">"This is hello world from lib\n"</span>);
        <span style="color: #a1db00;">return</span> 0;
    }
</pre>
</div>

<p>
再写一个调用的 <code>main.c</code> 函数：
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #d18aff;">    #include</span> <span style="color: #ff4ea3;">&lt;stdio.h&gt;</span>
<span style="color: #d18aff;">    #include</span> <span style="color: #ff4ea3;">&lt;stdlib.h&gt;</span>
<span style="color: #d18aff;">    #include</span> <span style="color: #ff4ea3;">&lt;string.h&gt;</span>


    <span style="color: #00d7af;">int</span> <span style="color: #ffd700;">main</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">args</span>,<span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">argv</span>[])
    {
        from_lib();
        <span style="color: #a1db00;">return</span> 0;
    }
</pre>
</div>

<p>
对应的 <code>Makefile</code> ：
</p>
<div class="org-src-container">
<pre class="src src-makefile-gmake">    <span style="color: #ffd700;">.PHONY</span>:libtest a.out
    <span style="color: #ffd700;">a.out</span>:
            echo <span style="color: #ff4ea3;">"compile a.out"</span>
            gcc main.c -L. -ltest
    <span style="color: #ffd700;">libtest</span>:
            gcc lib.c -fPIC -shared -o libtest.so
    <span style="color: #ffd700;">clean</span>:
            rm -rfv libtest.so a.out
</pre>
</div>

<p>
需要设置变量 <code>LD_LIBRARY_PATH</code> ，把当前路径加入其中然后执行：
</p>
<div class="org-src-container">
<pre class="src src-sh">    <span style="color: #d18aff;">export</span> <span style="color: #ff8700;">LD_LIBRARY_PATH</span>=<span style="color: #ff4ea3;">"/tmp/dynamic"</span>
    ./a.out
</pre>
</div>

<p>
一行流执行应该这样：
</p>
<div class="org-src-container">
<pre class="src src-sh">    <span style="color: #ff8700;">LD_LIBRARY_PATH</span>=<span style="color: #ff4ea3;">"."</span> ./a.out
</pre>
</div>
</div>
</div>

<div id="outline-container-org650ab7c" class="outline-2">
<h2 id="org650ab7c"><span class="section-number-2">2</span> 一个更详细的例子和说明（翻译）</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://www.cprogramming.com/tutorial/shared-libraries-linux-gcc.html">参考文档</a>
</p>

<p>
有下面三个文件：
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #d18aff;">#if</span><span style="color: #d18aff;">n</span><span style="color: #d18aff;">def</span> foo_h__                                                                                                                 
<span style="color: #d18aff;">#define</span> <span style="color: #ff8700;">foo_h__</span>                                                                                                                 
                                                                                                                                                
<span style="color: #a1db00;">extern</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">foo</span>(<span style="color: #00d7af;">void</span>);                                                                                                          
                                                                                                                                                
<span style="color: #d18aff;">#endif</span>  <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">foo_h__                                                                                                              </span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">##foo.c: </span><span style="color: #6c6c6c; font-style: italic;">*/</span>                                                                                                                        
                                                                                                                                                
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;stdio.h&gt;</span>                                                                                                              

<span style="color: #00d7af;">void</span> <span style="color: #ffd700;">foo</span>(<span style="color: #00d7af;">void</span>)                                                                                                                  
{                                                                                                                               
    puts(<span style="color: #ff4ea3;">"Hello, I'm a shared library"</span>);                                                                                        
}                                                                                                                               
</pre>
</div>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #6c6c6c; font-style: italic;">/* </span><span style="color: #6c6c6c; font-style: italic;">##main.c: </span><span style="color: #6c6c6c; font-style: italic;">*/</span>                                                                                                                       
                                                                                                                                                
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;stdio.h&gt;</span>                                                                                                              
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">"foo.h"</span>                                                                                                                
                                                                                                                                                
<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">main</span>(<span style="color: #00d7af;">void</span>)                                                                                                                  
{                                                                                                                               
    puts(<span style="color: #ff4ea3;">"This is a shared library test..."</span>);                                                                                   
    foo();                                                                                                                      
    <span style="color: #a1db00;">return</span> 0;                                                                                                                   
}                                                                                                                               
</pre>
</div>

<ol class="org-ol">
<li><p>
编译出“位置无关”代码（Position Independent Code，PIC）：
</p>
<pre class="example">
$ gcc -c -Wall -Werror -fpic foo.c
</pre></li>
<li><p>
基于目标文件创建一个动态链接库：
</p>
<pre class="example">
     gcc -shared -o libfoo.so foo.o
</pre></li>
<li><p>
把动态库和程序链接起来：
</p>
<pre class="example">
$ gcc -Wall -o test main.c -lfoo                                                                                                
/usr/bin/ld: cannot find -lfoo                                                                                                  
collect2: ld returned 1 exit status                                                                                             
</pre>
<p>
报错表示编译器找不到对应的库文件。需要使用 <code>-L</code> 参数来告诉编译器
到哪儿找对应的动态库文件。
</p>
<pre class="example">
$ gcc -L. -Wall -o test main.c -lfoo
</pre></li>
<li><p>
使运态库在运行时能被找到。
</p>
<pre class="example">
$ ./test                                                                                                                        
./test: error while loading shared libraries: libfoo.so: cannot open shared object file: No such file or directory     
</pre>
<p>
出现该错误说明该动态库找不到。
</p>
<ol class="org-ol">
<li><p>
可以通过设置 <code>LD_LIBRARY_PATH</code> 变量解决该问题：
</p>
<pre class="example">
   $ export LD_LIBRARY_PATH=.:$LD_LIBRARY_PATH                                                                    
   $ ./test                                                                                                                        
   This is a shared library test...                                                                                                
   Hello, I'm a shared library                                                                                                     
</pre></li>
<li><p>
还可以在编译的时候通 <code>-rpath</code> 指定一个固定的地址：
</p>
<pre class="example">
$ unset LD_LIBRARY_PATH                                                                                                         
$ gcc -L. -Wl,-rpath=. -Wall -o test main.c -lfoo                                             
$ ./test                                                                                                                        
This is a shared library test...                                                                                                
Hello, I'm a shared library                                                                                                     
</pre></li>
<li><p>
还可以把编译生成的 <code>so</code> 文件放到系统动态库默认目录中
<code>/usr/lib</code> 和 <code>/usr/local/lib</code> 。然后更新一下动态库的cache即可。
</p>
<pre class="example">
$ cp /home/username/foo/libfoo.so /usr/lib                                                                                      
$ chmod 0755 /usr/lib/libfoo.so                                                                                                 
$ ldconfig
</pre>
<p>
检查一下cache里面有没有：
</p>
<pre class="example">
$ ldconfig -p|grep foo        
libfoo.so (libc6) =&gt; /usr/lib/libfoo.so                                                                                         
</pre>
<p>
还可以再使用 <code>ldd</code> 来查看一下可执行文件 <code>test</code> 中依赖的是哪一个库：
</p>
<pre class="example">
$ ldd test | grep foo                                                                                                           
libfoo.so =&gt; /usr/lib/libfoo.so (0x00a42000)                                                                                    
</pre>
<p>
这下再重新来试一次：
</p>
<pre class="example">
$ unset LD_LIBRARY_PATH                                                                                                         
$ gcc -Wall -o test main.c -lfoo                                                                                                
$ ldd test | grep foo                                                                                                           
libfoo.so =&gt; /usr/lib/libfoo.so (0x00a42000)                                                                                    
$ ./test                                                                                                                        
This is a shared library test...                                                                                                
Hello, I'm a shared library                                                                                                     
</pre></li>
</ol></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Peng Xie</p>
<p class="date">Created: 2018-10-01 Mon 21:36</p>
<p class="validation"></p>
</div>
</body>
</html>